In [1]:
import pandas as pd

In [2]:
men2004_det = pd.read_csv('men2004_det.csv')
men2008_det = pd.read_csv('men2008_det.csv')

In [3]:
men2004_det.head(10)

                 Athlete   Medal  Count
0         BOVELL, George  Bronze      1
1    BREMBILLA, Emiliano  Bronze      1
2  CAPPELLAZZO, Federico  Bronze      1
3        CERCATO, Simone  Bronze      1
4           CONRAD, Lars  Silver      1
5           CROCKER, Ian  Bronze      1
6           CROCKER, Ian    Gold      1
7           CROCKER, Ian  Silver      1
8           CSEH, Laszlo  Bronze      1
9          DAVIES, David  Bronze      1

In [4]:
men2008_det.head(10)

               Athlete   Medal  Count
0       ADRIAN, Nathan    Gold      1
1        BERENS, Ricky    Gold      1
2       BERNARD, Alain  Bronze      1
3       BERNARD, Alain    Gold      1
4       BERNARD, Alain  Silver      1
5  BOUSQUET, Frederick  Silver      1
6         BRITS, Grant  Bronze      1
7        BRODIE, Leith  Bronze      2
8       CALLUS, Ashley  Bronze      1
9       CAVIC, Milorad  Silver      1

In [5]:
men2004_det.loc[men2004_det.Athlete == 'PHELPS, Michael']

            Athlete   Medal  Count
50  PHELPS, Michael  Bronze      2
51  PHELPS, Michael    Gold      6

In [6]:
men2008_det.loc[men2008_det.Athlete == 'PHELPS, Michael']

            Athlete Medal  Count
54  PHELPS, Michael  Gold      8

In [7]:
men0408 = men2004_det.merge(men2008_det, how = 'outer', on = 'Athlete', suffixes= ('_2004,', '_2008'))

In [8]:
men0408.loc[men0408.Athlete == 'PHELPS, Michael']

            Athlete Medal_2004,  Count_2004, Medal_2008  Count_2008
59  PHELPS, Michael      Bronze          2.0       Gold         8.0
60  PHELPS, Michael        Gold          6.0       Gold         8.0

In the above example, we can see how the merge operation joined the right information to both instances of PHELPS, where what we wanted to do was join the only the Gold rows together.

In [9]:
men0408 = men2004_det.merge(men2008_det, how = 'outer', on = ['Athlete', 'Medal'], suffixes= ('_2004,', '_2008'))

In [10]:
men0408.loc[men0408.Athlete == 'PHELPS, Michael']

            Athlete   Medal  Count_2004,  Count_2008
50  PHELPS, Michael  Bronze          2.0         NaN
51  PHELPS, Michael    Gold          6.0         8.0

If we switch to an inner join, we get only the rows that include the same value for both Athlete and Medal

In [11]:
men0408 = men2004_det.merge(men2008_det, how = 'inner', on = ['Athlete', 'Medal'], suffixes= ('_2004,', '_2008'))
men0408.loc[men0408.Athlete == 'PHELPS, Michael']

            Athlete Medal  Count_2004,  Count_2008
12  PHELPS, Michael  Gold            6           8